# Pandas

In [1]:
import pandas as pd

In [3]:
dataFrame = pd.DataFrame({ 'numbers': range(10), 'chars': ['a'] * 10 })

In [5]:
dataFrame

  chars  numbers
0     a        0
1     a        1
2     a        2
3     a        3
4     a        4
5     a        5
6     a        6
7     a        7
8     a        8
9     a        9

In [6]:
dataFrame = pd.read_csv('dataset.tsv', header=0, sep='\t')

In [7]:
dataFrame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [8]:
dataFrame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [9]:
dataFrame.shape

(6, 4)

In [11]:
newEntry = {'Name': 'Ivan Magda', 'Birth': '01.07.1995', 'City': 'Saint-Petersburg', 'Position': 'Software Developer'}
newEntry

{'Birth': '01.07.1995',
 'City': 'Saint-Petersburg',
 'Name': 'Ivan Magda',
 'Position': 'Software Developer'}

In [12]:
dataFrame.append(newEntry, ignore_index=True)

              Name       Birth              City            Position
0      Иванов А.А.  22.03.1980            Москва                 NaN
1     Сорокин И.В.  07.08.1965         Волгоград             инженер
2       Белов М.М.  13.02.1980            Ростов            менеджер
3  Мельникова Д.С.  15.04.1985            Ростов                 NaN
4      Рыбина Е.П.  19.11.1985            Москва             инженер
5     Костров С.О.  31.05.1985            Москва              стажер
6       Ivan Magda  01.07.1995  Saint-Petersburg  Software Developer

In [29]:
dataFrame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [30]:
dataFrame = dataFrame.append(newEntry, ignore_index=True)

In [31]:
dataFrame

              Name       Birth              City            Position
0      Иванов А.А.  22.03.1980            Москва                 NaN
1     Сорокин И.В.  07.08.1965         Волгоград             инженер
2       Белов М.М.  13.02.1980            Ростов            менеджер
3  Мельникова Д.С.  15.04.1985            Ростов                 NaN
4      Рыбина Е.П.  19.11.1985            Москва             инженер
5     Костров С.О.  31.05.1985            Москва              стажер
6       Ivan Magda  01.07.1995  Saint-Petersburg  Software Developer

In [33]:
dataFrame['IsStudent'] = [False]*4 + [True]*3

In [34]:
dataFrame

              Name       Birth              City            Position IsStudent
0      Иванов А.А.  22.03.1980            Москва                 NaN     False
1     Сорокин И.В.  07.08.1965         Волгоград             инженер     False
2       Белов М.М.  13.02.1980            Ростов            менеджер     False
3  Мельникова Д.С.  15.04.1985            Ростов                 NaN     False
4      Рыбина Е.П.  19.11.1985            Москва             инженер      True
5     Костров С.О.  31.05.1985            Москва              стажер      True
6       Ivan Magda  01.07.1995  Saint-Petersburg  Software Developer      True

In [35]:
dataFrame.drop([5,6], axis=0)

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      True

In [36]:
dataFrame

              Name       Birth              City            Position IsStudent
0      Иванов А.А.  22.03.1980            Москва                 NaN     False
1     Сорокин И.В.  07.08.1965         Волгоград             инженер     False
2       Белов М.М.  13.02.1980            Ростов            менеджер     False
3  Мельникова Д.С.  15.04.1985            Ростов                 NaN     False
4      Рыбина Е.П.  19.11.1985            Москва             инженер      True
5     Костров С.О.  31.05.1985            Москва              стажер      True
6       Ivan Magda  01.07.1995  Saint-Petersburg  Software Developer      True

In [37]:
dataFrame.drop([5, 6], axis=0, inplace=True)

In [38]:
dataFrame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      True

In [39]:
dataFrame.drop('IsStudent', axis=1, inplace=True)
dataFrame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер

In [40]:
dataFrame.to_csv('output.csv', sep=',', header=True, index=None)

In [41]:
!cat output.csv

Name,Birth,City,Position
Иванов А.А.,22.03.1980,Москва,
Сорокин И.В.,07.08.1965,Волгоград,инженер
Белов М.М.,13.02.1980,Ростов,менеджер
Мельникова Д.С.,15.04.1985,Ростов,
Рыбина Е.П.,19.11.1985,Москва,инженер